"""
*** Положительные персонажи
(4) Жених - может только голосовать днём
(4) Невеста - телохранитель жениха. Если нашла жениха, и на него нападают, жених остаётся жив и невеста палит нападающего  
(4) Гость - может только голосовать.
(5) Свекровь - выполняет функцию доктора, поит пострадавшего рассолом и тот оживает 
(7) Тамада - катан. Его цель - спасти свадьбу. ищет отрицательных персонажей и сдает полиции
(9) Подружка невесты - путана - выводит из строя отвергнутых женихов на одну ночь. Ну и любых других персонажей.
(11) Бабушка - даёт иммунитет на 1 ночь
(13) Свидетель – бомж - наблюдает за игроками ночью, может один раз за ночь проверить, кто противник.

*** Отрицательные персонажи
(4) Буян - жаждет начистить физиономию жениху и сорвать свадьбу. Мафия.
(6) Тёща - кидается закатками. очень опасна. Дон
(8) Подруга тёщи - аналог бомжа, но работает на отрицательную сторону.
(10) Дедушка-склерозник - выводит из строя персонажа на 2 ночи (рассказывает ему всякую чепуху). Играет через раз.
(12)  Тесть - адвокат - защищает тёщу

*** Нейтральные персонажи
(14) Клоун - приходит в гости к кому угодно и отвлекает его, мешая ему выполнять задания
(15) Гость с Юга - при каждом ходе с вероятностью 1/3 может раскрыть роль игрока
(16) Подружка невесты - хулиганка – поит персонажа, к которому приходит, и тот путает цель.
(17) Непьющий Гость - желает уйти со свадьбы и делает всё, чтоб его заподозрили в принадлежности к Буянам
(18) Забулдыга - незваный гость. Пристает ко всем и бьёт им... лица
"""
Этих не понял.
Положительные (за свадьбу, «городские»)
Повар – готовит «счастливое угощение», даёт бонус голосования на один день: его выбор засчитывается дважды.
 Отрицательные (соперники свадьбы)

 Нейтральные / «дикари»
Фотограф – его цель собрать «все фотографии» без раскрытия роли. Побеждает, если остаётся живым к концу игры.
Диджей – может один раз сменить результат дня (например, поменять голосования).