"""
Краткое описание игры
В игре принимают участие от 4 человек до 20
Игра представляет собой свадьбу. На свадьбе присутствуют положительные
персонажи - Жених, Невеста, Гость, Свекровь, Тамада, Подружка Невесты,
Бабушка и Свидетель. Им весело, они хотят провести свадьбу так, чтобы никто
и ничто этому не помешало. Но на свадьбе присутствуют и отрицательные 
персонажи - Буян, Тёща, Подруга Тёщи, Дедушка-склерозник и Тесть. Они 
хотят сорвать свадьбу и начистить физиономию жениху, что приведет к 
отмене свадьбы. Также на свадьбе присутствуют и нейтральные персонажи - 
Клоун, Гость с Юга, Хулиганка (она же подружка невесты), Непьющий Гость 
и Забулдыга. Если отрицательные персонажи удалены со свадьбы, или их 
осталось в 2 раза меньше положительных - свадьба удалась. Если 
положительных персонажей не осталось, или осталось в 2 раза меньше,
чем отрицательных, свадьба сорвана. Если жениху начистили физиономию
Буяны, Забулдыга или Тёща попала в него закруткой - свадьба провалена.


*** Положительные персонажи
(4) Жених - может только голосовать днём
(4) Невеста - телохранитель жениха. Если нашла жениха, и на него нападают, жених остаётся жив и невеста палит нападающего  
(4) Гость - может только голосовать.
(5) Свекровь - выполняет функцию доктора, поит пострадавшего рассолом и тот оживает 
(7) Тамада - катан. Его цель - спасти свадьбу. ищет отрицательных персонажей и сдает полиции
(9) Подружка невесты - путана - выводит из строя отвергнутых женихов на одну ночь. Ну и любых других персонажей.
(11) Бабушка - даёт иммунитет на 1 ночь
(13) Свидетель – бомж - наблюдает за игроками ночью, может один раз за ночь проверить, кто противник.

*** Отрицательные персонажи
(4) Буян - жаждет начистить физиономию жениху и сорвать свадьбу. Мафия.
(6) Тёща - кидается закатками. очень опасна. Дон
(8) Подруга тёщи - аналог бомжа, но работает на отрицательную сторону.
(10) Дедушка-склерозник - выводит из строя персонажа на 2 ночи (рассказывает ему всякую чепуху). Играет через раз.
(12)  Тесть - адвокат - защищает тёщу

*** Нейтральные персонажи
(14) Клоун - приходит в гости к кому угодно и отвлекает его, мешая ему выполнять задания
(15) Гость с Юга - при каждом ходе с вероятностью 1/3 может раскрыть роль игрока
(16) Хулиганка – поит персонажа, к которому приходит, и тот путает цель.
(17) Непьющий Гость - желает уйти со свадьбы и делает всё, чтоб его заподозрили в принадлежности к Буянам
(18) Забулдыга - незваный гость. Пристает ко всем и бьёт им... лица
"""
Этих не понял.
Положительные (за свадьбу, «городские»)
Повар – готовит «счастливое угощение», даёт бонус голосования на один день: его выбор засчитывается дважды.
 Отрицательные (соперники свадьбы)

 Нейтральные / «дикари»
Фотограф – его цель собрать «все фотографии» без раскрытия роли. Побеждает, если остаётся живым к концу игры.
Диджей – может один раз сменить результат дня (например, поменять голосования).